app/views/articles/_form.html.erb

SELECT "categories".id FROM "categories" INNER JOIN "articles_categories" ON "categories"."id" = "articles_categories"."category_id" WHERE "articles_categories"."article_id" = 22
---
    <label>Categories:</label>
    <%= collection_select(:article, :category_ids, Category.all, :id, :name,{:include_blank => 'None'},
    {:multiple => true, :name=>'article[category_ids][]',:selected => 0}) %>