app/views/articles/show.html.erb

<h3>Categories:
  <% @article.categories.each do |cat| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "articles_categories" ON "categories"."id" = "articles_categories"."category_id" WHERE "articles_categories"."article_id" = 22