app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
SELECT "categories".* FROM "categories"
---
  def index
    if params[:search] != nil && params[:search].size > 0
      @title = "Results for '#{params[:search]}'"
      @articles = Article.where("title LIKE ?", "%#{params[:search]}%")
    elsif params[:cat] != nil
      @title = "Category '#{params[:cat]}'"
      @articles = Category.find_by_name(params[:cat]).articles
    else
      @title = "All Articles"
      @articles = Article.all

INSERT INTO "articles" ("created_at", "slug", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Tue, 25 Mar 2014 21:27:21 UTC +00:00], ["slug", nil], ["title", "hello world"], ["updated_at", Tue, 25 Mar 2014 21:27:21 UTC +00:00]]
---
  def create
    authorize
    # raise(params.to_s)
    @article = Article.new(params[:article])

    if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "updates".* FROM "updates" WHERE "updates"."article_id" = 17 ORDER BY "updates"."id" DESC LIMIT 1
---
  def edit
    authorize
    @article = Article.find(params[:id])

    if @article.locked && !current_user.admin
      @content = @article.updates.last.content

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "updates".* FROM "updates" WHERE "updates"."article_id" = 1 ORDER BY "updates"."id" DESC LIMIT 1
---
  def show
    @article = Article.find(params[:id])
    @content = @article.updates.last.content

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", "Andy von Dohren"]]
UPDATE "articles" SET "title" = 'Andrew von Dohren', "updated_at" = '2014-03-24 21:50:16.866883' WHERE "articles"."id" = 1
---
  def update
    authorize
    @article = Article.find(params[:id])

    if @article.update_attributes(params[:article])

DELETE FROM "articles" WHERE "articles"."id" = 1
---
  def destroy
    authorize
    admin
    Article.delete(params[:id])