app/controllers/updates_controller.rb

  def create
    @new_update = Update.new(params[:update])

    if @new_update.save
---
INSERT INTO "updates" ("article_id", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def show
    @update = Update.find(params[:id])
---
SELECT "updates".* FROM "updates" WHERE "updates"."id" = $1 LIMIT 1  [["id", "1"]]