app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    if @user.save
---
INSERT INTO "users" ("admin", "created_at", "email", "fname", "lname", "password_digest", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"